package com.nikosoft.soldierfinder;


import android.widget.Switch;

import java.util.Arrays;

import de.mrapp.android.dialog.adapter.ArrayAdapter;

/**
 * Created by Yosef on 04/11/2017.
 */

public class States_Cities {



    public String[] IranStates =
            {"آذربایجان شرقی", "آذربایجان غربی", "اردبیل", "اصفهان", "البرز", "ایلام", "بوشهر", "تهران", "چهارمحال و بختیاری"
                    , "خراسان جنوبی", "خراسان رضوی", "خراسان شمالی", "خوزستان", "زنجان", "سمنان", "سیستان و بلوچستان", "فارس", "قزوین", "قم", "کردستان"
                    , "کرمان", "کرمانشاه", "کهگیلویه و بویراحمد", "گلستان", "گیلان", "لرستان", "مازندران", "مرکزی", "هرمزگان", "همدان", "یزد"};

    public String[] Azar_shargi =
            {"آبش احمد",
                    "آچاچی",
                    "آذرشهر",
                    "آقکند",
                    "اسکو",
                    "اهر",
                    "ایلخچی",
                    "باسمنج",
                    "بخشایش",
                    "بستا نآباد",
                    "بناب",
                    "بناب مرند",
                    "تبریز",
                    "ترک (شهر)",
                    "تیمورلو (آذرشهر)",
                    "ترکمانچای",
                    "تسوج",
                    "تیکم هداش",
                    "جلفا (شهر)",
                    "جوا نقلعه",
                    "خاروانا",
                    "خامنه",
                    "خداجو",
                    "خسروشاه",
                    "خمارلو",
                    "خواجه(شهر)",
                    "دوزدوزان",
                    "زرنق",
                    "زنوز",
                    "سراب (شهر)",
                    "سردرود",
                    "سهند (شهر)",
                    "سیس",
                    "سی هرود",
                    "شبستر",
                    "شربیان",
                    "شرفخانه",
                    "شندآباد",
                    "صوفیان (شهر)",
                    "عجبشیر",
                    "قر ه آغاج (چاراویماق)",
                    "کشکسرای",
                    "کلوانق",
                    "کلیبر",
                    "کوز هکنان",
                    "گوگان",
                    "لیلان",
                    "مبار کشهر",
                    "مراغه",
                    "مرند",
                    "ملکان",
                    "ممقان",
                    "مهربان (شهر)",
                    "میانه (شهر)",
                    "نظرکهریزی",
                    "وایقان",
                    "ورزقان",
                    "هادیشهر",
                    "هریس",
                    "هشترود",
                    "هوراند",
                    "یامچی",

            };

    public String[] Azar_garbi =
            {"آواجیق",
                    "ارومیه",
                    "اشنویه",
                    "ایواوغلی",
                    "باروق",
                    "بازرگان (شهر)",
                    "بوکان",
                    "پلدشت",
                    "پیرانشهر",
                    "تاز هشهر",
                    "تکاب",
                    "چهاربرج (میاندوآب)",
                    "خلیفان",
                    "خوی",
                    "ربط (شهر)",
                    "زرآباد (خوی)",
                    "سردشت",
                    "سرو (شهر)",
                    "سلماس",
                    "سیلوانه",
                    "سیمینه",
                    "سی هچشمه",
                    "شاهی ندژ",
                    "شوط",
                    "فیرورق",
                    "قر هضیاءالدین",
                    "قطور (شهر)",
                    "قوشچی (شهر)",
                    "کشاورز (شهر)",
                    "گردکشانه",
                    "ماکو",
                    "محمدیار",
                    "محمودآباد (آذربایجان غربی)",
                    "مرگنلر",
                    "مهاباد",
                    "میاندوآب",
                    "میرآباد",
                    "نازک علیا",
                    "نالوس",
                    "نقده",
                    "نوشی نشهر",
            };
    public String[] Ardabil =
            {"آبی بیگلو",
                    "اردبیل",
                    "اصلاندوز",
                    "بیله سوار",
                    "پارس آباد",
                    "تازه کند (شهر)",
                    "تازه کند انگوت",
                    "جعفرآباد (بیله سوار)",
                    "خلخال",
                    "رضی",
                    "سرعین",
                    "عنبران",
                    "فخرآباد (اردبیل)",
                    "کلور",
                    "کوراییم",
                    "گرمی (شهر)",
                    "گیوی",
                    "لاهرود",
                    "مشگین شهر",
                    "نمین",
                    "نیر",
                    "هشجین",
                    "هیر (اردبیل)",
            };
    public String[] Esfahan =
            {"ابریشم (شهر)",
                    "ابوزیدآباد",
                    "اردستان",
                    "اژیه",
                    "اصفهان",
                    "افوس",
                    "انارک",
                    "آران و بیدگل",
                    "ایمانشهر",
                    "بادرود",
                    "باغ بهادران",
                    "بافران",
                    "برف انبار",
                    "بهارانشهر",
                    "بهارستان (اصفهان)",
                    "بوئین و میاندشت",
                    "پیربکران",
                    "تودشک",
                    "تیران",
                    "جندق",
                    "جوزدان (شهر)",
                    "چادگان",
                    "چرمهین",
                    "چمگردان",
                    "حبیب آباد (اصفهان)",
                    "حسن آباد (اصفهان)",
                    "حنا (شهر)",
                    "خالدآباد",
                    "خمینی شهر",
                    "خوانسار",
                    "خور (اصفهان)",
                    "خوراسگان",
                    "خورزوق",
                    "داران",
                    "دامنه (شهر)",
                    "درچ هپیاز",
                    "دستگرد (برخوار)",
                    "دهاقان",
                    "دهق",
                    "دولت آباد (اصفهان)",
                    "دیزیچه",
                    "رزوه (شهر)",
                    "رضوانشهر (اصفهان)",
                    "زاینده رود (شهر)",
                    "زرین شهر",
                    "زواره",
                    "زیار (اصفهان)",
                    "زیباشهر",
                    "سده لنجان",
                    "سفیدشهر",
                    "سگزی",
                    "سمیرم",
                    "شاپورآباد",
                    "شاهین شهر",
                    "شهرضا",
                    "طالخونچه",
                    "عسگران",
                    "علویجه",
                    "فرخی (شهر)",
                    "فریدون شهر",
                    "فلاورجان",
                    "فولادشهر",
                    "قهدریجان",
                    "کاشان",
                    "کرکوند",
                    "کلیشاد و سودرجان",
                    "کمشجه",
                    "کمه",
                    "کهریزسنگ",
                    "کوشک (اصفهان)",
                    "کوه پایه (شهر)",
                    "گز (برخوار و میمه)",
                    "گلپایگان",
                    "گلدشت (اصفهان)",
                    "گلشهر (اصفهان)",
                    "گلشن (شهر)",
                    "گوگد",
                    "مبارکه",
                    "محمدآباد (اصفهان)",
                    "محسن آباد",
                    "مشکات (شهر)",
                    "منظریه",
                    "مهاباد (اصفهان)",
                    "میمه (اصفهان)",
                    "نایین",
                    "نوش آباد",
                    "نجف آباد",
                    "نصرآباد (اصفهان)",
                    "نطنز",
                    "نیک آباد",
                    "ورزنه (اصفهان)",
                    "ورنامخواست",
                    "ونک (اصفهان)",
                    "هرند",
                    "وزوان",
            };
    public String[] Alborz =
            {"آسارا",
                    "اشتهارد",
                    "چهارباغ (البرز)",
                    "شهر جدید هشتگرد",
                    "طالقان (شهر)",
                    "کرج",
                    "کما لشهر",
                    "کوهسار (البرز)",
                    "گرمدره",
                    "گلسار",
                    "ماهدشت",
                    "محمدشهر",
                    "مشکین دشت",
                    "نظرآباد",
                    "هشتگرد",
            };
    public String[] Ilam =
            {"آبدانان",
                    "آسمان آباد",
                    "ارکواز",
                    "ایلام",
                    "ایوان (شهر)",
                    "بدره",
                    "پهله (ایلام)",
                    "توحید (شهر)",
                    "چوار",
                    "دره شهر",
                    "دلگشا (ملکشاهی)",
                    "دهلران",
                    "زرنه",
                    "سرابله",
                    "سرا بباغ",
                    "صالح آباد (ایلام)",
                    "لومار",
                    "ماژین",
                    "مورموری",
                    "موسیان",
                    "مهر (ملکشاهی)",
                    "مهران (شهر)",
                    "میمه (ایلام)",
            };
    public String[] Boshehr =
            {"آباد",
                    "آب پخش",
                    "آبدان",
                    "امام حسن (شهر)",
                    "انارستان (جم)",
                    "اهرم (شهر)",
                    "بادوله",
                    "برازجان",
                    "بردخون",
                    "بردستان",
                    "بندر بوشهر",
                    "بندر دیر",
                    "بندر دیلم",
                    "بندر ریگ",
                    "بندر سیراف",
                    "بندر کنگان",
                    "بندر گناوه",
                    "بنک",
                    "بوشکان",
                    "تنگ ارم",
                    "جم (شهر)",
                    "چغادک",
                    "جزیره خارک",
                    "خورموج",
                    "دالکی",
                    "دلوار",
                    "دوراهک",
                    "ریز (شهر)",
                    "سعدآباد (بوشهر)",
                    "شبانکاره (بوشهر)",
                    "شنبه (شهر)",
                    "عالی شهر",
                    "عسلویه",
                    "کاکی",
                    "کلمه (شهر)",
                    "نخل تقی",
                    "وحدتیه",
            };
    public String[] Tehran =
            {"آبسرد (تهران)",
                    "آبعلی",
                    "ارجمند (شهر)",
                    "اسلا مشهر",
                    "اندیشه (شهر)",
                    "باغستان (تهران)",
                    "باقرشهر",
                    "بومهن",
                    "پاکدشت",
                    "پردیس (شهر)",
                    "پرند (شهر)",
                    "پیشوا (شهر)",
                    "تهران",
                    "جوادآباد",
                    "چهاردانگه (اسلا مشهر)",
                    "حسن آباد (ری)",
                    "دماوند (شهر)",
                    "رباط کریم",
                    "رودهن",
                    "شاهدشهر",
                    "شریف آباد",
                    "شمشک",
                    "شهر ری",
                    "شهریار (شهر)",
                    "صالحیه (تهران)",
                    "صباشهر",
                    "صفادشت",
                    "فردوسیه",
                    "فشم",
                    "فیروزکوه",
                    "شهر قدس",
                    "(تهران)",
                    "قرچک",
                    "کهریزک",
                    "کیلان",
                    "گلستان (تهران)",
                    "لواسان",
                    "ملارد",
                    "نسیم شهر",
                    "نصیرشهر",
                    "وحیدیه",
                    "ورامین",
            };
    public String[] Chaharmahal =
            {"آلونی",
                    "اردل",
                    "باباحیدر (شهر)",
                    "بروجن",
                    "بلداجی",
                    "بن (شهرکرد)",
                    "بیرگان",
                    "پرندجان",
                    "جعفرآباد (چهارمحال و بختیاری)",
                    "جونقان",
                    "چالشتر",
                    "چلگرد",
                    "چلیچه",
                    "دستنا (شهرکرد)",
                    "دشتک (اردل)",
                    "سامان (شهر)",
                    "سرخون (بختیاری)",
                    "سفیددشت",
                    "سودجان",
                    "سورشجان",
                    "شلمزار",
                    "شهرکرد",
                    "طاقانک",
                    "فارسان",
                    "فرادنبه",
                    "فرخ شهر",
                    "کاج (شهر)",
                    "کیان (شهر)",
                    "گندمان (بروجن)",
                    "گهرو",
                    "گوجان",
                    "لردگان",
                    "مالخلیفه",
                    "منج",
                    "ناغان",
                    "نافچ",
                    "نقنه",
                    "هفشجان",
                    "وردنجان",
            };
    public String[] Khorasan_gonobi =
            {"آرین شهر",
                    "ارسک",
                    "اسدیه",
                    "اسفدن",
                    "اسلامیه",
                    "آیسک",
                    "بشرویه",
                    "بیرجند",
                    "حاجی آباد (شهر)",
                    "خضری دشت بیاض",
                    "خوسف",
                    "دیهوک",
                    "زهان",
                    "سرایان",
                    "سربیشه",
                    "سه قلعه (شهر)",
                    "شوسف",
                    "طبس",
                    "طبس مسینا",
                    "عشق آباد (طبس)",
                    "فردوس",
                    "قائن",
                    "قهستان (شهر)",
                    "گزیک (درمیان)",
                    "محمدشهر (خوسف)",
                    "مود (شهر)",
                    "نهبندان",
                    "نیمبلوک",
            };
    public String[] Khorasan_razavi =
            {"انابد",
                    "باجگیران",
                    "باخرز",
                    "بار (نیشابور)",
                    "بایگ",
                    "بجستان",
                    "بردسکن",
                    "بیدخت",
                    "تایباد",
                    "تربت جام",
                    "تربت حیدریه",
                    "جغتای",
                    "جنگل (شهر)",
                    "چاپشلو",
                    "چکنه",
                    "چناران",
                    "خرو",
                    "خلی لآباد",
                    "خواف",
                    "داورزن",
                    "دررود",
                    "درگز",
                    "دول تآباد (خراسان رضوی)",
                    "رباط سنگ",
                    "رشتخوار",
                    "رضویه",
                    "رودآب",
                    "ریوش",
                    "سبزوار",
                    "سرخس",
                    "سلامی",
                    "سلطا نآباد (خراسان رضوی)",
                    "سنگان (شهر)",
                    "شادمهر",
                    "شاندیز",
                    "ششتمد",
                    "شهرآباد",
                    "صال حآباد (خراسان رضوی)",
                    "طرقبه",
                    "عش قآباد (خراسان رضوی)",
                    "فرهادگرد",
                    "فریمان",
                    "فیروزه",
                    "فی ضآباد (خراسان رضوی)",
                    "قاس مآباد",
                    "قدمگاه",
                    "قلندرآباد",
                    "قوچان",
                    "کاخک",
                    "کاریز (شهر)",
                    "کاشمر",
                    "کدکن",
                    "کلات (خراسان رضوی)",
                    "کندر (شهر)",
                    "گناباد",
                    "لطف آباد",
                    "مشهد",
                    "مشهد ریزه",
                    "مل کآباد",
                    "نشتیفان",
                    "نصرآباد (خراسان رضوی)",
                    "نقاب (جوین)",
                    "نوخندان",
                    "نیشابور",
                    "نی لشهر",
                    "هم تآباد (خراسان رضوی)",
                    "یونسی",
            };
    public String[] Khorasan_shomali =
            {"آشخانه",
                    "اسفراین",
                    "بجنورد",
                    "پی شقلعه",
                    "جاجرم",
                    "حصار گر مخان",
                    "درق",
                    "ایور",
                    "راز (شهر)",
                    "سنخواست",
                    "شوقان",
                    "شیروان",
                    "صفی آباد",
                    "فاروج",
                    "قاضی (شهر)",
                    "گرمه (شهر)",
                    "لوجلی",
                    "تیتکانلو",
            };
    public String[] Khozestan =
            {"آبادان",
                    "آغاجاری",
                    "ابوحمیظه",
                    "اروندکنار",
                    "الوان (شهر)",
                    "الهایی",
                    "امیدیه",
                    "اندیمشک",
                    "اهواز",
                    "ایذه",
                    "باغ ملک",
                    "بستان، خوزستان",
                    "بندر خمینی",
                    "بندر ماهشهر",
                    "بهبهان",
                    "ترکالکی",
                    "تشان (خوزستان)",
                    "جایزان",
                    "جنت مکان",
                    "چمران (شهر)",
                    "حر ریاحی (شهر)",
                    "حسینیه(خوزستان)",
                    "حمیدیه (خوزستان)",
                    "خرمشهر",
                    "خنافره",
                    "دزآب",
                    "دزفول",
                    "دهدز",
                    "رامشیر",
                    "رامهرمز",
                    "رفیع (شهر)",
                    "زهره (شهر)",
                    "سالند",
                    "سردشت (خوزستان)",
                    "سوسنگرد",
                    "شادگان",
                    "شوش",
                    "شوشتر",
                    "شیبان (اهواز)",
                    "صف یآباد (خوزستان)",
                    "صیدون",
                    "قلع هتل",
                    "قلعه خواجه",
                    "کارون (شهر)",
                    "کوت سیدنعیم",
                    "گتوند",
                    "گلگیر (شهر)",
                    "لالی",
                    "مسجدسلیمان",
                    "مقاومت (شهر)",
                    "ملاثانی",
                    "منصوریه (خوزستان)",
                    "میانرود",
                    "مینوشهر",
                    "هفتکل",
                    "هندیجان",
                    "هویزه",
                    "ویس (شهر)",
            };
    public String[] Zanjan =
            {"آببر (زنجان)",
                    "ابهر",
                    "ارمغان خانه",
                    "چورزق",
                    "حلب (زنجان)",
                    "خرمدره",
                    "دندی (زنجان)",
                    "زرین آباد",
                    "زرین رود",
                    "زنجان",
                    "سجاس",
                    "سلطانیه",
                    "سهرورد",
                    "صایی نقلعه",
                    "قیدار",
                    "کرسف",
                    "گرماب (شهر)",
                    "ماه نشان",
                    "نیک پی (زنجان)",
                    "هیدج",
            };
    public String[] Semnan =
            {"آرادان",
                    "امیریه (دامغان)",
                    "ایوانکی",
                    "بسطام",
                    "بیارجمند",
                    "دامغان",
                    "درجزین",
                    "دیباج",
                    "سرخه",
                    "سمنان",
                    "شاهرود",
                    "شهمیرزاد",
                    "کلاته خیج",
                    "کلاته رودبار",
                    "گرمسار",
                    "مجن",
                    "مهدی شهر",
                    "میامی (شاهرود)",
            };
    public String[] Sistan_balochestan =
            {"ادیمی",
                    "اسپکه",
                    "ایرانشهر",
                    "بزمان",
                    "بمپور",
                    "بنت",
                    "بنجار",
                    "پیشین",
                    "جالق",
                    "چابهار",
                    "خاش",
                    "دوست محمد",
                    "راسک",
                    "زابل",
                    "زاهدان",
                    "زهک",
                    "گشت",
                    "سراوان",
                    "سرباز",
                    "سوران",
                    "سیرکان",
                    "فنوج",
                    "قصرقند",
                    "کنارک",
                    "گلمورتی",
                    "محمدآباد",
                    "مهرستان",
                    "میرجاوه",
                    "نصرت آباد",
                    "نگور",
                    "نوک آباد",
                    "نیک شهر",
            };
    public String[] Fars =
            {"آباده",
                    "ارد",
                    "اردکان",
                    "ارسنجان",
                    "استهبان",
                    "اسیر",
                    "اشکنان",
                    "افزر",
                    "اقلید",
                    "اهل",
                    "اوز",
                    "ایج",
                    "ایزدخواست",
                    "باب انار",
                    "بالاده",
                    "بنارویه",
                    "بهمن",
                    "بیرم",
                    "بیضا",
                    "جنت شهر",
                    "جهرم",
                    "جویم",
                    "حاجی آباد",
                    "خانمین",
                    "خاوران",
                    "خرامه",
                    "خشت",
                    "خنج",
                    "خور",
                    "خوم هزار",
                    "داراب",
                    "داریان",
                    "دوزه",
                    "دهرم",
                    "رامجرد",
                    "رونیز",
                    "زاهدشهر",
                    "زرقان",
                    "سده",
                    "سروستان",
                    "سعادت شهر",
                    "سورمق",
                    "سوریان",
                    "سیدان",
                    "ششده",
                    "شهرپیر",
                    "شیراز",
                    "صغاد",
                    "صفاشهر",
                    "علامرودشت",
                    "فراشبند",
                    "فسا",
                    "فیروزآباد",
                    "قائمیه",
                    "قادرآباد",
                    "قطب آباد",
                    "قیر",
                    "کارزین",
                    "کازرون",
                    "کامفیروز",
                    "کره ای",
                    "کنارتخته",
                    "کوار",
                    "گراش",
                    "گله دار",
                    "لار",
                    "لامرد",
                    "لپوئی",
                    "لطیفی",
                    "مرودشت",
                    "مشکان",
                    "مصیری",
                    "مهر",
                    "میمند",
                    "نوجین",
                    "نودان",
                    "نورآباد",
                    "نیریز",
                    "وراوی",
                    "هماشهر",
                    "سلطانشهر",
            };
    public String[] Qazvin =
            {"آبگرم",
                    "آبیک",
                    "آوج",
                    "ارداق",
                    "اسفرورین",
                    "اقبالیه",
                    "الوند",
                    "بوئین زهرا",
                    "بیدستان",
                    "تاکستان",
                    "خاکعلی",
                    "خرمدشت",
                    "دانسفهان",
                    "رازمیان",
                    "سگزآباد",
                    "سیردان",
                    "شال",
                    "ضیاءآباد",
                    "قزوین",
                    "کوهین",
                    "محمدیه",
                    "محمودآباد نمونه",
                    "معلم کلایه",
                    "نرجه",
            };
    public String[] Qom =
            {"جعفریه",
                    "دستجرد",
                    "سلفچگان",
                    "قم",
                    "قنوات",
                    "کهک (قم)",
            };
    public String[] Kordestan =
            {"آرمرده",
                    "اورامان",
                    "بابارشانی",
                    "بانه",
                    "بلبان آباد",
                    "بویین سفلی",
                    "بیجار",
                    "پیرتاج",
                    "توپ آغاج",
                    "چناره",
                    "دزج",
                    "دلبران",
                    "دهگلان",
                    "دیواندره",
                    "زرینه",
                    "سروآباد",
                    "سریش آباد",
                    "سقز",
                    "سنندج",
                    "شویشه",
                    "صاحب",
                    "قروه",
                    "کامیاران",
                    "کانی دینار",
                    "کانی سور",
                    "مریوان",
                    "موچش",
                    "یاسوکند",
            };
    public String[] Kerman =
            {"اختیارآباد",
                    "ارزوئیه",
                    "امین شهر",
                    "انار",
                    "اندوهجرد",
                    "باغین",
                    "بافت",
                    "بردسیر",
                    "بروات",
                    "بزنجان",
                    "بم",
                    "بهرمان",
                    "پاریز",
                    "جبالبارز",
                    "جوزم",
                    "جوپار",
                    "جیرفت",
                    "چترود",
                    "خاتون آباد",
                    "خانوک",
                    "خرسند",
                    "درب بهشت",
                    "دهج",
                    "رابر",
                    "راور",
                    "راین",
                    "رفسنجان",
                    "رودبار",
                    "ریحان شهر",
                    "زرند",
                    "زنگی آباد",
                    "زیدآباد",
                    "سیرجان",
                    "شهداد",
                    "شهربابک",
                    "صفائیه",
                    "عنبرآباد",
                    "فاریاب",
                    "فهرج",
                    "قلعه گنج",
                    "کاظم آباد",
                    "کرمان",
                    "کشکوئیه",
                    "کهنوج",
                    "کوهبنان",
                    "کیانشهر",
                    "گلباف",
                    "گلزار",
                    "ماهان",
                    "محمدآباد",
                    "محی آباد",
                    "مردهک",
                    "مس سرچشمه",
                    "منوجان",
                    "نجفشهر",
                    "نرماشیر",
                    "نظامشهر",
                    "نگار",
                    "نودژ",
                    "هجدک",
                    "هنزا",
                    "یزدانشهر",
            };
    public String[] Kermanshah =
            {"ازگله",
                    "اسلام آباد غرب",
                    "بانه وره",
                    "باینگان",
                    "بیستون",
                    "پاوه",
                    "تازه آباد",
                    "جوانرود",
                    "حمیل",
                    "رباط",
                    "روانسر",
                    "ریجاب",
                    "سرپل ذهاب",
                    "سرمست",
                    "سطر",
                    "سنقر",
                    "سومار",
                    "شاهو",
                    "صحنه",
                    "قصر شیرین",
                    "کرمانشاه",
                    "کرند غرب",
                    "کنگاور",
                    "کوزران",
                    "گهواره",
                    "گودین",
                    "گیلانغرب",
                    "میانراهان",
                    "نودشه",
                    "نوسود",
                    "هرسین",
                    "هلشی",
            };
    public String[] Kohgiloyeh =
            {"باشت",
                    "پاتاوه",
                    "چرام",
                    "چیتاب",
                    "دهدشت",
                    "دوگنبدان",
                    "دیشموک",
                    "سوق",
                    "سی سخت",
                    "قلعه رئیسی",
                    "گراب سفلی",
                    "لنده",
                    "لیکک",
                    "مارگون",
                    "یاسوج",
            };
    public String[] Golestan =
            {"آزادشهر",
                    "آققلا",
                    "انبار آلوم",
                    "اینچه برون",
                    "بندر ترکمن",
                    "بندر گز",
                    "خان ببین",
                    "دلند",
                    "رامیان",
                    "سرخنکلاته",
                    "سیمین شهر",
                    "علی آباد",
                    "فاضل آباد",
                    "فراغی",
                    "کردکوی",
                    "کلاله",
                    "گالیکش",
                    "گرگان",
                    "گمیشان",
                    "گنبد کاووس",
                    "مراوه تپه",
                    "مینودشت",
                    "نگین شهر",
                    "نوده خاندوز",
                    "نوکنده",
            };
    public String[] Gilan =
            {"آستارا",
                    "آستانه اشرفیه",
                    "احمدسرگوراب",
                    "اسالم",
                    "اطاقور",
                    "املش",
                    "بازارجمعه",
                    "بره سر",
                    "بندر انزلی",
                    "پره سر",
                    "ماکلوان",
                    "توتکابن",
                    "جیرنده",
                    "چابکسر",
                    "چاف و چمخاله",
                    "چوبر",
                    "حویق",
                    "خشکبیجار",
                    "خمام",
                    "دیلمان",
                    "رانکوه",
                    "رحیم آباد",
                    "رستم آباد",
                    "رشت",
                    "رضوان شهر",
                    "رودبار",
                    "رودسر",
                    "رودبنه",
                    "سنگر",
                    "سیاهکل",
                    "شفت",
                    "شلمان",
                    "صومعه سرا",
                    "فومن",
                    "کلاچای",
                    "کوچصفهان",
                    "کومله",
                    "کیاشهر",
                    "گوراب زرمیخ",
                    "لاهیجان",
                    "لشت نشا",
                    "لنگرود",
                    "لوشان",
                    "لوندویل",
                    "لیسار",
                    "ماسال",
                    "ماسوله",
                    "مرجغل",
                    "منجیل",
                    "واجارگاه",
                    "هشتپر",
            };
    public String[] Lorestan =
            {"ازنا",
                    "اشترینان",
                    "الشتر",
                    "الیگودرز",
                    "بروجرد",
                    "پل دختر",
                    "چالانچولان",
                    "چغلوندی",
                    "چقابل",
                    "خرم آباد",
                    "درب گنبد",
                    "دورود",
                    "زاغه",
                    "سپیددشت",
                    "سراب دوره",
                    "شول آباد",
                    "فیروزآباد",
                    "کونانی",
                    "کوهدشت",
                    "گراب",
                    "معمولان",
                    "مومن آباد",
                    "نورآباد",
                    "ویسیان",
            };
    public String[] Mazandaran =
            {"ارطه",
                    "آلاشت",
                    "امامزاده عبدالله",
                    "آمل",
                    "امیرکلا",
                    "ایزدشهر",
                    "بابل",
                    "بابلسر",
                    "بلده",
                    "بهشهر",
                    "بهنمیر",
                    "پل سفید",
                    "تنکابن",
                    "جویبار",
                    "چالوس",
                    "چمستان",
                    "خرم آباد",
                    "خلیل شهر",
                    "خوش رودپی",
                    "دابودشت",
                    "رامسر",
                    "رستمکلا",
                    "رویان",
                    "رینه",
                    "زرگرمحله",
                    "زیرآب",
                    "ساری",
                    "سرخ رود",
                    "سلمان شهر",
                    "سورک",
                    "شیرگاه",
                    "شیرود",
                    "عباس آباد",
                    "فریدون کنار",
                    "فریم",
                    "قائم شهر",
                    "کتالم و سادات شهر",
                    "کلارآباد",
                    "کلاردشت",
                    "کله بست",
                    "کوهی خیل",
                    "کیاسر",
                    "کیاکلا (سیمرغ)",
                    "گزنک",
                    "گلوگاه",
                    "گلوگاه بابل",
                    "گتاب",
                    "محمودآباد",
                    "مرزن آباد",
                    "مرزیکلا",
                    "نشتارود",
                    "نکا",
                    "نور",
                    "نوشهر",
            };
    public String[] Markazi =
            {"آستانه (مرکزی)",
                    "آشتیان",
                    "آوه",
                    "اراک",
                    "(اناج)پرندک",
                    "تفرش",
                    "توره",
                    "جاورسیان",
                    "خشکرود (زرندیه)",
                    "خمین",
                    "خنداب",
                    "خنجین",
                    "داوودآباد",
                    "دلیجان (مرکزی)",
                    "رازقان",
                    "زاویه (استان مرکزی)",
                    "ساروق",
                    "ساوه",
                    "شازند",
                    "شهباز (شهر)",
                    "غرق آباد",
                    "فرمه",
            };
    public String[] Hormozgan =
            {"ابوموسی (شهر)",
                    "بستک",
                    "بندر چارک",
                    "بندر خمیر",
                    "بندرعباس",
                    "بندر لنگه",
                    "پارسیان (شهر)",
                    "تازیان پایین",
                    "تیرور",
                    "جاسک",
                    "جناح (شهر)",
                    "حاجی آباد (هرمزگان)",
                    "درگهان",
                    "دهبارز",
                    "رویدر",
                    "زیارت علی",
                    "سردشت (هرمزگان)",
                    "سندرک",
                    "سوزا",
                    "سیریک",
                    "فارغان",
                    "فین(هرمزگان)",
                    "قشم (شهر)",
                    "کنگ",
                    "کوخرده رنگ",
                    "کوهستک",
                    "کیش (شهر)",
                    "لمزان",
                    "هرمز (شهر)",
                    "هشت بندی",
                    "میناب",
                    "لیردف",
            };
    public String[] Hamedan =
            {"ازندریان",
                    "اسدآباد (همدان)",
                    "برزول",
                    "بهار (شهر)",
                    "تویسرکان",
                    "جورقان",
                    "جوکار",
                    "دمق (شهر)",
                    "رزن",
                    "زنگنه",
                    "سامن",
                    "سرکان",
                    "شیری نسو",
                    "صالح آباد (همدان)",
                    "فامنین",
                    "فرسفج",
                    "فیروزان (شهر)",
                    "قروه درجزین",
                    "قهاوند",
                    "کبودرآهنگ",
                    "گل تپه (همدان)",
                    "گیان",
                    "لالجین",
                    "مریانج",
                    "ملایر",
                    "مهاجران",
                    "نهاوند",
                    "همدان",
            };
    public String[] Yazd =
            {"ابرکوه",
                    "احمدآباد (یزد)",
                    "اردکان (یزد)",
                    "اشکذر",
                    "بافق",
                    "بفروئیه",
                    "بهاباد",
                    "تفت",
                    "حمیدیا",
                    "خضرآباد (اشکذر)",
                    "زارچ",
                    "شاهدیه",
                    "عقدا",
                    "مروست",
                    "مهردشت",
                    "مهریز",
                    "میبد",
                    "ندوشن",
                    "نیر (یزد)",
                    "هرات (یزد)",
                    "یزد",
            };

    public int GetStatePosition(String item, String[] Collection) {
        try {
            for (int i = 0; i <= Collection.length; i++) {
                if (Collection[i].toString().equals(item))
                    return i;

            }
        }
        catch (Exception e) {

        }
        return -1;
    }

    public int GetCityPosition(String item, String State) {
        int pos = GetStatePosition(State, IranStates);
        int city_pos = -1;
        switch (pos) {
            case 0:
                for (int i = 0; i < Azar_shargi.length; i++) {
                    if (Azar_shargi[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }

                }

            case 1:
                for (int i = 0; i < Azar_garbi.length; i++) {
                    if (Azar_garbi[i].toString().equals(item))
                        {
                            city_pos = i;
                            break;

                    }
                }
                break;
            case 2:
                for (int i = 0; i < Ardabil.length; i++) {
                    if (Ardabil[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 3:
                for (int i = 0; i < Esfahan.length; i++) {
                    if (Esfahan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }

                }
                break;
            case 4:
                for (int i = 0; i < Alborz.length; i++) {
                    if (Alborz[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }

                }
                break;
            case 5:
                for (int i = 0; i < Ilam.length; i++) {
                    if (Ilam[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }

                }
                break;
            case 6:
                for (int i = 0; i < Boshehr.length; i++) {
                    if (Boshehr[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }

                }
                break;
            case 7:
                for (int i = 0; i < Tehran.length; i++) {
                    if (Tehran[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 8:
                for (int i = 0; i < Chaharmahal.length; i++) {
                    if (Chaharmahal[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 9:
                for (int i = 0; i < Khorasan_gonobi.length; i++) {
                    if (Khorasan_gonobi[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 10:
                for (int i = 0; i < Khorasan_razavi.length; i++) {
                    if (Khorasan_razavi[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 11:
                for (int i = 0; i < Khorasan_shomali.length; i++) {
                    if (Khorasan_shomali[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 12:
                for (int i = 0; i < Khozestan.length; i++) {
                    if (Khozestan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 13:
                for (int i = 0; i < Zanjan.length; i++) {
                    if (Zanjan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 14:
                for (int i = 0; i < Semnan.length; i++) {
                    if (Semnan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 15:
                for (int i = 0; i < Sistan_balochestan.length; i++) {
                    if (Sistan_balochestan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 16:
                for (int i = 0; i < Fars.length; i++) {
                    if (Fars[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 17:
                for (int i = 0; i < Qazvin.length; i++) {
                    if (Qazvin[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 18:
                for (int i = 0; i < Qom.length; i++) {
                    if (Qom[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 19:
                for (int i = 0; i < Kordestan.length; i++) {
                    if (Kordestan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 20:
                for (int i = 0; i < Kerman.length; i++) {
                    if (Kerman[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 21:
                for (int i = 0; i < Kermanshah.length; i++) {
                    if (Kermanshah[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 22:
                for (int i = 0; i < Kohgiloyeh.length; i++) {
                    if (Kohgiloyeh[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 23:
                for (int i = 0; i < Golestan.length; i++) {
                    if (Golestan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 24:
                for (int i = 0; i < Gilan.length; i++) {
                    if (Gilan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 25:
                for (int i = 0; i < Lorestan.length; i++) {
                    if (Lorestan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 26:
                for (int i = 0; i < Mazandaran.length; i++) {
                    if (Mazandaran[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 27:
                for (int i = 0; i < Markazi.length; i++) {
                    if (Markazi[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 28:
                for (int i = 0; i < Hormozgan.length; i++) {
                    if (Hormozgan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 29:
                for (int i = 0; i < Hamedan.length; i++) {
                    if (Hamedan[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
            case 30:
                for (int i = 0; i < Yazd.length; i++) {
                    if (Yazd[i].toString().equals(item)) {
                        city_pos = i;
                        break;
                    }
                }
                break;
        }

        return city_pos;
    }

    public String[] GetStatesCities(int state_pos) {
        final String[] temp = {"ابتدا استان را انتخاب کنید"};
        String[] array = new String[0];

        switch (state_pos) {
            case -1:
                array = temp;


                break;

            case 0:
                array = (Azar_shargi);


                break;
            case 1:
                array = (Azar_garbi);


                break;
            case 2:
                array = (Ardabil);

                break;
            case 3:
                array = (Esfahan);

                break;
            case 4:
                array = (Alborz);

                break;
            case 5:
                array = (Ilam);

                break;
            case 6:
                array = (Boshehr);

                break;
            case 7:
                array = (Tehran);

                break;
            case 8:
                array = (Chaharmahal);

                break;
            case 9:
                array = (Khorasan_gonobi);

                break;
            case 10:
                array = (Khorasan_razavi);

                break;
            case 11:
                array = (Khorasan_shomali);

                break;
            case 12:
                array = (Khozestan);

                break;
            case 13:
                array = (Zanjan);

                break;
            case 14:
                array = (Semnan);

                break;
            case 15:
                array = (Sistan_balochestan);

                break;
            case 16:
                array = (Fars);

                break;
            case 17:
                array = (Qazvin);

                break;
            case 18:
                array = (Qom);

                break;
            case 19:
                array = (Kordestan);

                break;
            case 20:
                array = (Kerman);

                break;
            case 21:
                array = (Kermanshah);

                break;
            case 22:
                array = (Kohgiloyeh);

                break;
            case 23:
                array = (Golestan);

                break;
            case 24:
                array = (Gilan);

                break;
            case 25:
                array = (Lorestan);

                break;
            case 26:
                array = (Mazandaran);

                break;
            case 27:
                array = (Markazi);

                break;
            case 28:
                array = (Hormozgan);

                break;
            case 29:
                array = (Hamedan);

                break;
            case 30:
                array = (Yazd);

                break;

        }
        return array;
    }
}
